Revit 2025 API
AirHeatExchangerType Enumeration
 The type of air loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AirHeatExchangerType
Public Enumeration AirHeatExchangerType
public enum class AirHeatExchangerType
type AirHeatExchangerType
Members
Member name | Value | Description
None | 0
Enthalpy | 1
Sensible | 2
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace